app/controllers/teacher/school_classes_controller.rb

INSERT INTO "school_classes" ("active", "created_at", "name", "profile", "school_id", "teacher_id", "updated_at", "year", "yearbook") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @school_class = current_teacher.school_classes.build(params[:school_class])
    @school_class.save ? redirect_to(:action => "index") : render(:action => "new")

SELECT "school_classes".* FROM "school_classes" WHERE "school_classes"."teacher_id" = 1 AND "school_classes"."id" = $1 ORDER BY created_at ASC LIMIT 1  [["id", "4"]]
DELETE FROM "school_classes" WHERE "school_classes"."id" = 8
---
  def destroy
    school_class = current_teacher.school_classes.find(params[:id])
    redirect_to(:action => "index") if school_class.destroy