app/controllers/teacher/semesters_controller.rb

  def create
    @semester = current_teacher.school_classes.find(params[:semester][:school_class_id]).semesters.build(params[:semester])
    @semester.save ? redirect_to(:controller => "school_classes", :action => "index") : render(:action => "index")
---
SELECT "school_classes".* FROM "school_classes" WHERE "school_classes"."teacher_id" = 1 AND "school_classes"."id" = $1 ORDER BY created_at ASC LIMIT 1  [["id", "6"]]
SELECT "semesters".* FROM "semesters" WHERE (teacher_id = 1 AND active = 't') ORDER BY created_at ASC LIMIT 1
INSERT INTO "semesters" ("active", "created_at", "school_class_id", "semester", "teacher_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["active", true], ["created_at", Tue, 24 Apr 2012 14:30:44 UTC +00:00], ["school_class_id", 4], ["semester", 2], ["teacher_id", 1], ["updated_at", Tue, 24 Apr 2012 14:30:44 UTC +00:00]]
UPDATE "semesters" SET "active" = 'f', "semester" = 2, "updated_at" = '2012-04-24 14:30:44.965657' WHERE "semesters"."id" = 8

  def destroy
    @semester = current_teacher.semesters.find(params[:id])
    @semester.destroy
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."teacher_id" = 1 AND "semesters"."id" = $1 ORDER BY created_at ASC LIMIT 1  [["id", "13"]]
DELETE FROM "semesters" WHERE "semesters"."id" = $1  [["id", 8]]

  def activate
    @semester = current_teacher.semesters.find(params[:id])
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."teacher_id" = 1 AND "semesters"."id" = $1 ORDER BY created_at DESC LIMIT 1  [["id", "11"]]