app/controllers/teacher/subjects_controller.rb

INSERT INTO "subjects" ("created_at", "deleted", "name", "school_class_id", "school_id", "teacher_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @subject = current_teacher.school_class.subjects.build(params[:subject])
    @subject.save ? redirect_to(:controller => "teacher/subjects", :action => "index") : render(:action => "index")

SELECT "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = $1 ORDER BY created_at ASC LIMIT 1  [["id", 10]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."school_class_id" = 10 AND "subjects"."id" = $1 LIMIT 1  [["id", "4"]]
SELECT "descriptions".* FROM "descriptions" WHERE "descriptions"."semester_id" = 19 AND (subject_id = 4)
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = $1 ORDER BY created_at ASC LIMIT 1  [["id", 19]]
---
  def show
    @subject = current_teacher.school_class.subjects.find(params[:id])
    @descriptions = current_teacher.semester.descriptions.where('subject_id = ' + params[:id])