app/views/teacher/school_classes/index.html.erb

SELECT "semesters".* FROM "semesters" WHERE "semesters"."school_class_id" = 6 ORDER BY created_at DESC
---

      <% school_class.semesters.each do |semester| %>